zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/dev/main.c
/*
 * @brief Callback function for switching off the LED after data reception
 *
 * @param parameter Pointer to callback parameter
 *                  (not used in this application, but could be if desired).
 */
static void rx_data_led_off_cb(void *parameter)
{
	LED_Off(LED_DATA);

	parameter = parameter; /* Keep compiler happy. */
}

#if (defined ENABLE_SLEEP || defined RTC_SLEEP)
static void enter_sleep(uint32_t timeout)
{   
    sys_sleep = true;
	#ifdef ENABLE_SLEEP
	ENTER_CRITICAL_REGION();
	common_tc_stop();
	common_tc_init();
	set_common_tc_overflow_callback(hw_overflow_cb);
	set_common_tc_expiry_callback(hw_expiry_cb);
	timeout = timeout-150;
	sw_timer_start(APP_TIMER_SLEEP,timeout,
	SW_TIMEOUT_RELATIVE,
	(FUNC_PTR)wakeup_cb,
	NULL);
    LEAVE_CRITICAL_REGION();
	system_set_sleepmode(SYSTEM_SLEEPMODE_IDLE_2);
	system_sleep();
    #endif
    #ifdef RTC_SLEEP
	configure_rtc_count();
/* Configure and enable callback */
   configure_rtc_callbacks();
   /* Set period */
	res = timeout % 1000;
	timeout = timeout/1000;	
	rtc_count_set_period(timeout);
	system_set_sleepmode(SYSTEM_SLEEPMODE_STANDBY);
	system_sleep();
	#endif
	
}
#ifdef RTC_SLEEP
void configure_rtc_count(void)
{
	//! [init_conf]
	struct rtc_count_config config_rtc_count;
	rtc_count_get_config_defaults(&config_rtc_count);
	//! [init_conf]

	//! [set_config]
	config_rtc_count.prescaler           = RTC_COUNT_PRESCALER_DIV_1;
	config_rtc_count.mode                = RTC_COUNT_MODE_16BIT;
	config_rtc_count.continuously_update = true;
	//! [set_config]
	//! [init_rtc]
	rtc_count_init(&config_rtc_count);
	//! [init_rtc]

	//! [enable]
	rtc_count_enable();
	//! [enable]
}
//! [initialize_rtc]

//! [setup_callback]
void configure_rtc_callbacks(void)
{
	//! [reg_callback]
	rtc_count_register_callback(
	rtc_overflow_callback, RTC_COUNT_CALLBACK_OVERFLOW);
	//! [reg_callback]
	//! [en_callback]
	rtc_count_enable_callback(RTC_COUNT_CALLBACK_OVERFLOW);
	//! [en_callback]
}
void rtc_overflow_callback(void)
{
	//! [overflow_act]
	/* Do something on RTC overflow here */
	rtc_count_disable();
	wakeup_cb(NULL);		
	
	
	//! [overflow_act]
}
#endif
void wakeup_cb(void *parameter)
{
	sys_sleep = false;
    #ifdef ENABLE_SLEEP
	ENTER_CRITICAL_REGION();
	common_tc_stop();
	common_tc_init();
	set_common_tc_overflow_callback(hw_overflow_cb);
	set_common_tc_expiry_callback(hw_expiry_cb);
	sw_timer_stop(APP_TIMER_SLEEP);
    LEAVE_CRITICAL_REGION();
	#endif
	mac_wakeup(res);
	
}
#endif

/*
 * @brief This function will show up the application 
 *        and stack build features and available in the firmware
 * @param void
 *                  
 */
static void print_stack_app_build_features(void)
{
#if ANTENNA_DIVERSITY   
    printf("\r\n Antenna Diversity : Enabled %d", ANTENNA_DIVERSITY);
#else
    printf("\r\n Antenna Diversity : Disabled %d", ANTENNA_DIVERSITY);	
#endif	          
			
#if ARM_MATH_CM0
    printf("\r\n ARM Cortex-M0 Math Library Support : Enabled");
#else
    printf("\r\n ARM Cortex-M0 Math Library Support : Disabled");
#endif

#ifdef BEACON_SUPPORT 
    printf("\r\n Beacon Support : Enabled");
#else
    printf("\r\n Beacon Support : Disabled");
#endif
  
#ifdef BOARD
    printf("\r\n Board Support : %d",  BOARD);
#else
    printf("\r\n Board Support : Not Defined");
#endif  
  
#ifdef CUSTOM_DEFAULT_TX_PWR
    printf("\r\n Custom default Tx Power : Defined ");
#else
   printf("\r\n Custom default Tx Power : Not used");
#endif

#if DISABLE_TSTAMP_IRQ
	printf("\r\n TRX Time Stamp IRQ : Enabled - %d", DISABLE_TSTAMP_IRQ);
#else
	printf("\r\n TRX Time Stamp IRQ : Disabled");
#endif  

#ifdef DEBUG
    printf("\r\n Debug : Enabled");
#else
    printf("\r\n Debug : Disabled");
#endif

#if TAL_TYPE
	printf("\r\n TRX Type : %d", TAL_TYPE);
#else
	printf("\r\n TRX Type : Not Specified");
#endif

#ifdef STB_ON_SAL
	printf("\r\n Security Tool Box On SAL : Enabled");
#else
	printf("\r\n Security Tool Box On SAL : Disabled");
#endif

#ifdef CUSTOM_PWR_TABLE
	printf("\r\n Power Table : Custom");
#else
	printf("\r\n Custom power table not used");
#endif

#if SAL_TYPE
printf("\r\n SAL Type : %d", SAL_TYPE);
#else
printf("\r\n SAL Type not defined");
#endif

#ifdef EXT_RF_FRONT_END_CTRL
printf("\r\n External RF Front End Control for External PA : Enabled");
#else
printf("\r\n External RF Front End Control for External PA : Disabled");
#endif

#if EXTERN_EEPROM_AVAILABLE
	printf("\r\n External EEPROM Available");
#else
	printf("\r\n External EEPROM Not Available");
#endif

#if _DEBUG_
	printf("\r\n MAC Debug Support : Enabled");
#else
	printf("\r\n MAC Debug Support : Disabled");
#endif

#if TC_ASYNC
	printf("\r\n Timer Counter Asynchronous Module : Enabled");
#else
	printf("\r\n Timer Counter Asynchronous Module : Disabled");
#endif

#if PAL_USE_SPI_TRX
	printf("\r\n TRX Communication via SPI : Yes");
#else
	printf("\r\n TRX Communication via SPI : No");
#endif

#if SPI_CALLBACK_MODE
	printf("\r\n SPI Callback Mode : Enabled");
#else
	printf("\r\n SPI Callback Mode : Disabled");
#endif

#ifdef SIO_HUB
	printf("\r\n SIO Hub : Enabled");
#else
	printf("\r\n SIO Hub : Disabled");
#endif

#if (HIGHEST_STACK_LAYER == MAC)
	printf("\r\n Highest Stack Layer : MAC");
#elif (HIGHEST_STACK_LAYER == TAL)
    printf("\r\n Highest Stack Layer : TAL");
#elif (HIGHEST_STACK_LAYER == RF4CE)
	printf("\r\n Highest Stack Layer : RF4CE");	
#elif (HIGHEST_STACK_LAYER == PAL)
	printf("\r\n Highest Stack Layer : PAL");
#elif (HIGHEST_STACK_LAYER == RTB)
	printf("\r\n Highest Stack Layer : RTB");
#else
	printf("\r\n Highest Stack Layer : Not Specified");	
#endif

#if USART_CALLBACK_MODE
	printf("\r\n USART Callback Mode : Enabled");
#else
	printf("\r\n USART Callback Mode : Disabled");
#endif

#if EXTINT_CALLBACK_MODE
	printf("\r\n External Interrupt Callback Mode : Enabled");
#else
	printf("\r\n External Interrupt Callback Mode : Disabled");
#endif

#ifdef MAC_SECURITY_ZIP 
	printf("\r\n MAC Data & Security Module : Enabled");
#else
	printf("\r\n MAC Data & Security Module : Disabled");
#endif	

#ifdef MAC_SECURITY_BEACON
printf("\r\n MAC Beacon Security : Enabled");
#else
printf("\r\n MAC Beacon Security : Disabled");
#endif

#ifdef GTS_SUPPORT 
printf("\r\n MAC GTS Support : Enabled");
#else
printf("\r\n MAC GTS Support : Disabled");
#endif
}


